#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_user_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=da39a3ee5e6b4b0d3255bfef95601890afd80709][0m
[0m[1mdata.local_file.file_user_prompt: Read complete after 0s [id=da39a3ee5e6b4b0d3255bfef95601890afd80709][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.azure_ai_speech.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/vdnlytcs-dev-uai001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mazapi_resource.subnet_function: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/WebAppSubnet][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/serverFarms/vdnlytcs-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_4o: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/deployments/gpt-4o][0m
[0m[1mmodule.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/c936f9ce-47fb-77da-8561-51f4204d6269][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/bf874819-1c11-e94a-01dc-7d37ba2dc7b8][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001/providers/Microsoft.Authorization/roleAssignments/addf7ac8-d5af-d09e-8bb1-e4f4e0bcd82f][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001|applicationLogs-0][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aoai001-account-pe][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-kv001-vault-pe][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Insights/components/vdnlytcs-dev-appi001|applicationLogs-0][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/e07b5460-cfda-ea64-f26b-ba46b54797a7][0m
[0m[1mmodule.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/267fbc75-419a-6987-ad18-46d97163902b][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-table-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-blob-pe][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_storage_queue_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/43617188-c7b0-2e6b-28a1-a92542834115][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-file-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcsdevstg001-queue-pe][0m
[0m[1mmodule.azure_ai_generic.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.azure_ai_speech.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001|applicationLogs-0][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:56:59Z][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:56:47Z][0m
[0m[1mmodule.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.azure_ai_generic.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-aig001-account-pe][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_cognitive_services_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001/providers/Microsoft.Authorization/roleAssignments/ca539b24-2931-27a4-8a0d-e25286b79467][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-analysis-video/providers/Microsoft.Authorization/roleAssignments/7877ca1a-6833-9337-295b-4a19fd2a68bd][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_cognitive_services_openai_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/ca7878e9-7e06-3a7b-4da8-983c4b16d93a][0m
[0m[1mazurerm_role_assignment.cognitive_account_roleassignment_storage_blob_data_reader: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-videos/providers/Microsoft.Authorization/roleAssignments/f8e8a15b-b90d-b4ed-7081-96df15f50933][0m
[0m[1mmodule.azure_ai_speech.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-ais001-account-pe][0m
[0m[1mmodule.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001][0m
[0m[1mmodule.azure_ai_generic.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-analysis-speech/providers/Microsoft.Authorization/roleAssignments/d7445129-2fbd-3b1e-f6f5-9dd59f1d6558][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_cognitive_services_openai_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/3f41f35b-e43c-efd1-2217-25fecd3e3696][0m
[0m[1mazurerm_role_assignment.ai_speech_roleassignment_storage_blob_data_reader: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/blobServices/default/containers/internal-videos/providers/Microsoft.Authorization/roleAssignments/ad584f8e-1ba9-b7df-ec6a-646f5462ed45][0m
[0m[1mmodule.azure_ai_speech.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001|applicationLogs-0][0m
[0m[1mmodule.azure_ai_generic.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001|applicationLogs-0][0m
[0m[1mazurerm_linux_function_app.linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001][0m
[0m[1mmodule.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:57:28Z][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-analysis-video"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-analysis-video][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-analysis-speech"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-analysis-speech][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["internal-videos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/internal-videos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["upload-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/upload-newsvideos][0m
[0m[1mmodule.storage_account.azurerm_storage_container.storage_container["results-newsvideos"]: Refreshing state... [id=https://vdnlytcsdevstg001.blob.core.windows.net/results-newsvideos][0m
[0m[1mmodule.azure_ai_generic.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-21T11:00:12Z][0m
[0m[1mmodule.azure_ai_speech.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T21:57:57Z][0m
[0m[1mazurerm_role_assignment.function_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/4ebaac6a-5705-3db9-1fd2-c7122213718e][0m
[0m[1mazurerm_role_assignment.function_roleassignment_storage_queue_data_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/207154c3-1be0-17e2-541d-84d32c08d9e3][0m
[0m[1mazurerm_role_assignment.function_roleassignment_storage_account_contributor: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001/providers/Microsoft.Authorization/roleAssignments/7932c340-170a-d11a-7a88-59be2b6fb423][0m
[0m[1mazurerm_private_endpoint.linux_function_app_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Network/privateEndpoints/vdnlytcs-dev-app001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_function_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_function_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_azure_ai_speech_cognitive_account_primary_access_key[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_azure_ai_speech_cognitive_account_primary_access_key" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.KeyVault/vaults/vdnlytcs-dev-kv001"
      [32m+[0m[0m name                    = "azure-ai-speech-primary-access-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_linux_function_app.linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_linux_function_app" "linux_function_app" {
      [33m~[0m[0m app_settings                                   = {
          [31m-[0m[0m "AZURE_AI_SERVICE_API_VERSION"                    = "2024-05-01-preview"
          [31m-[0m[0m "AZURE_AI_SERVICE_BASE_URL"                       = "https://vdnlytcs-dev-aig001.cognitiveservices.azure.com/"
          [31m-[0m[0m "AZURE_AI_SPEECH_API_VERSION"                     = "2024-05-15-preview"
          [31m-[0m[0m "AZURE_AI_SPEECH_BASE_URL"                        = "https://vdnlytcs-dev-ais001.cognitiveservices.azure.com/"
          [31m-[0m[0m "AZURE_FUNCTIONS_ENVIRONMENT"                     = "Production"
          [31m-[0m[0m "AZURE_OPEN_AI_API_VERSION"                       = "2024-05-01-preview"
          [31m-[0m[0m "AZURE_OPEN_AI_BASE_URL"                          = "https://vdnlytcs-dev-aoai001.openai.azure.com/"
          [31m-[0m[0m "AZURE_OPEN_AI_DEPLOYMENT_NAME"                   = "gpt-4o"
          [31m-[0m[0m "AZURE_OPEN_AI_TEMPERATURE"                       = "0.0"
          [31m-[0m[0m "AZURE_SDK_TRACING_IMPLEMENTATION"                = "opentelemetry"
          [31m-[0m[0m "AZURE_TRACING_ENABLED"                           = "true"
          [31m-[0m[0m "ApplicationInsightsAgent_EXTENSION_VERSION"      = "~3"
          [31m-[0m[0m "AzureWebJobsFeatureFlags"                        = "EnableWorkerIndexing"
          [31m-[0m[0m "AzureWebJobsSecretStorageKeyVaultClientId"       = "df17e6a7-c1f5-4c45-9f2e-30167e5975e2"
          [31m-[0m[0m "AzureWebJobsSecretStorageKeyVaultUri"            = "https://vdnlytcs-dev-kv001.vault.azure.net/"
          [31m-[0m[0m "AzureWebJobsSecretStorageType"                   = "keyvault"
          [31m-[0m[0m "BlobTrigger__blobServiceUri"                     = "https://vdnlytcsdevstg001.blob.core.windows.net/"
          [31m-[0m[0m "BlobTrigger__clientId"                           = "df17e6a7-c1f5-4c45-9f2e-30167e5975e2"
          [31m-[0m[0m "BlobTrigger__credential"                         = "managedidentity"
          [31m-[0m[0m "BlobTrigger__queueServiceUri"                    = "https://vdnlytcsdevstg001.queue.core.windows.net/"
          [31m-[0m[0m "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "2"
          [31m-[0m[0m "MANAGED_IDENTITY_CLIENT_ID"                      = "df17e6a7-c1f5-4c45-9f2e-30167e5975e2"
          [31m-[0m[0m "ROOT_FOLDER_NAME"                                = "newstagextraction"
          [31m-[0m[0m "SCM_DO_BUILD_DURING_DEPLOYMENT"                  = "1"
          [31m-[0m[0m "STORAGE_CONTAINER_INTERNAL_ANALYSIS_SPEECH_NAME" = "internal-analysis-speech"
          [31m-[0m[0m "STORAGE_CONTAINER_INTERNAL_ANALYSIS_VIDEO_NAME"  = "internal-analysis-video"
          [31m-[0m[0m "STORAGE_CONTAINER_INTERNAL_VIDEOS_NAME"          = "internal-videos"
          [31m-[0m[0m "STORAGE_CONTAINER_RESULTS_NAME"                  = "results-newsvideos"
          [31m-[0m[0m "STORAGE_CONTAINER_UPLOAD_NAME"                   = "upload-newsvideos"
          [31m-[0m[0m "STORAGE_DOMAIN_NAME"                             = "https://vdnlytcsdevstg001.blob.core.windows.net/"
          [31m-[0m[0m "SYSTEM_PROMPT"                                   = [90mnull[0m[0m
          [31m-[0m[0m "USER_PROMPT"                                     = [90mnull[0m[0m
          [31m-[0m[0m "WEBSITE_CONTENTOVERVNET"                         = "1"
          [31m-[0m[0m "WEBSITE_OS_TYPE"                                 = "Linux"
        } -> (known after apply)
        id                                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001"
        name                                           = "vdnlytcs-dev-app001"
        tags                                           = {
            "workload" = "video-analytics"
        }
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_function_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_function_app" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Web/sites/vdnlytcs-dev-app001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.azure_ai_generic.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aig001"
        name                    = "vdnlytcs-dev-aig001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_ai_speech.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001"
    }

[1m  # module.azure_ai_speech.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                      [33m~[0m[0m defaultAction       = "Allow" [33m->[0m[0m "Deny"
                        [90m# (2 unchanged attributes hidden)[0m[0m
                    }
                  [33m~[0m[0m publicNetworkAccess = "Enabled" [33m->[0m[0m "Disabled"
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001"
        name                    = "vdnlytcs-dev-ais001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.azure_ai_speech.azurerm_cognitive_account.cognitive_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_cognitive_account" "cognitive_account" {
        id                                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001"
      [33m~[0m[0m local_auth_enabled                 = false [33m->[0m[0m true
        name                               = "vdnlytcs-dev-ais001"
      [33m~[0m[0m public_network_access_enabled      = true [33m->[0m[0m false
        tags                               = {
            "workload" = "video-analytics"
        }
        [90m# (11 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_acls {
          [33m~[0m[0m default_action = "Allow" [33m->[0m[0m "Deny"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.azure_ai_speech.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_account" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-ais001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "Audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.azure_open_ai.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [33m~[0m[0m body                    = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                        [90m# (3 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        )
        id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.CognitiveServices/accounts/vdnlytcs-dev-aoai001"
        name                    = "vdnlytcs-dev-aoai001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001"
    }

[1m  # module.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_storage_account" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Capacity" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "Transaction" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.storage_account.azurerm_storage_account.storage_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/vdnlytcs-dev-va-rg/providers/Microsoft.Storage/storageAccounts/vdnlytcsdevstg001"
        name                               = "vdnlytcsdevstg001"
      [33m~[0m[0m public_network_access_enabled      = true [33m->[0m[0m false
        tags                               = {
            "workload" = "video-analytics"
        }
        [90m# (95 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_rules {
          [33m~[0m[0m default_action             = "Allow" [33m->[0m[0m "Deny"
            [90m# (3 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/*/providers/Microsoft.CognitiveServices/accounts/*" [33m->[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/storageDataScanner"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/storageDataScanner" [33m->[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/*/providers/Microsoft.CognitiveServices/accounts/*"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        }

        [90m# (5 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 9 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>